##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [1]:
import numpy as np
import pandas as pd

In [2]:
# titanic.csv 파일 로드

df = pd.read_csv('./data/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
# titanic 데이터셋의 메타 데이터 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- 기초문제

In [5]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
# 생존자의 수 출력
live = df[df['Survived'] == 1].shape[0]
die = df[df['Survived'] == 0].shape[0]

print(live, die)

342 549

In [6]:
# 2. 승객 나이의 평균 출력
avg_age = df['Age'].mean()
print(avg_age)

29.69911764705882

In [7]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력 (운임 = 탑승 요금)
idx = df[df['Pclass'] == 1]['Fare'].idxmax()
print(df.loc[idx, 'Name'])

Ward, Miss. Anna

In [8]:
# 4. 여성 승객의 수를 구하여 출력
df[df['Sex'] == 'female'].shape[0]

314

In [9]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
df[df['Fare'] >= 50 ][['Name', 'Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [10]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
# 생존율 = 생존 인원 / 전체 인원
survive_rate = (df[(df['Age'] < 18) & (df['Survived'] == 1)].shape[0]) / df[df['Age'] < 18 ].shape[0]
print(survive_rate)

0.5398230088495575

In [11]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
avg_2ndfare = df[df['Pclass'] == 2]['Fare'].mean()
print(avg_2ndfare)

20.662183152173913

In [12]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
df[df['Age'] == df['Age'].max()][['Name', 'Age']]

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [13]:
# 9. S 항구에서 탑승한 승객의 수를 출력
df[df['Embarked'] == 'S'].shape[0]

644

In [14]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
third_male = df[(df['Pclass'] == 3) & (df['Sex'] == 'male')]
third_male[third_male['Survived'] == 1].shape[0]

47

- 고급문제

In [15]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
df.groupby(['Survived', 'Pclass'])['Age'].mean()

Survived  Pclass
0         1         43.695312
          2         33.544444
          3         26.555556
1         1         35.368197
          2         25.901566
          3         20.646118
Name: Age, dtype: float64

In [16]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
sib_fare = df[df['SibSp'] >= 3].sort_values('Fare', ascending=False).head(5)
sib_fare[['Name', 'Age']]

                               Name   Age
27   Fortune, Mr. Charles Alexander  19.0
88       Fortune, Miss. Mabel Helen  23.0
341  Fortune, Miss. Alice Elizabeth  24.0
159      Sage, Master. Thomas Henry   NaN
180    Sage, Miss. Constance Gladys   NaN

In [17]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
age_nan = df['Age'].isna()
df[age_nan]['Embarked'].value_counts()

Embarked
S    90
Q    49
C    38
Name: count, dtype: int64

In [18]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력
under_16 = df[df['Age'] < 16]
under_16[(under_16['SibSp'] == 0) & (under_16['Parch'] == 0)][['Name', 'Sex', 'Survived']]

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [19]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
fare_mean = df['Fare'].mean()
print(fare_mean)

first_class = df[(df['Pclass'] == 1) & (df['Fare'] > fare_mean)]
first_class[['Name', 'Age', 'Fare']]

32.204207968574636

                                                  Name   Age      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   53.1000
6                              McCarthy, Mr. Timothy J  54.0   51.8625
23                        Sloper, Mr. William Thompson  28.0   35.5000
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
..                                                 ...   ...       ...
853                          Lines, Miss. Mary Conover  16.0   39.4000
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667
867               Roebling, Mr. Washington Augustus II  31.0   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0   83.1583

[159 rows x 3 columns]

In [20]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력

df.dropna(subset=['Age', 'Pclass', 'Fare'])
fare_avg = df.groupby('Pclass')['Fare'].mean()
print(fare_avg)

fare_median = df.groupby('Pclass')['Fare'].median()
print(fare_median)

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64
Pclass
1    60.2875
2    14.2500
3     8.0500
Name: Fare, dtype: float64

In [21]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
df.groupby('Embarked')['Age'].mean()
max_port = df['Embarked'].value_counts().idxmax()
print(max_port)

port = df[df['Embarked'] == max_port]
port_survive = (port['Survived'] == 1).mean()
print(port_survive)

S
0.33695652173913043

In [22]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력
female_30 = df[(df['Sex'] == 'female') & (df['Age'] >= 30)]
female30_survive = (female_30['Survived'] == 1).mean()
print(female30_survive)

0.8070175438596491

In [23]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력
over_3 = df[(df['SibSp'] + df['Parch']) >= 3]

over3_survive = (over_3['Survived'] == 1).mean()
print(over3_survive)

0.34065934065934067

In [24]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
with_cabin = df.dropna(subset='Cabin').groupby('Pclass')
with_cabin['Survived'].mean()

Pclass
1    0.664773
2    0.812500
3    0.500000
Name: Survived, dtype: float64